# Lab | Connecting Python to SQL

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [2]:
password = getpass.getpass()

········

In [3]:
# 1. Establish a connection between Python and the Sakila database.
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [4]:
# 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) 
# from the Sakila database as a Pandas DataFrame.
def rentals_month (engine, month: int, year: int) -> pd.DataFrame:
    data = pd.read_sql_query(f'SELECT *, MONTH(rental_date) AS month, YEAR(rental_date) AS year FROM sakila.rental \
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}', engine)
    return data

In [5]:
rentals_month (create_engine('mysql+pymysql://root:'+password+'@localhost/sakila'), 5, 2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,year
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,5,2005
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,5,2005
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,5,2005
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,5,2005
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,5,2005
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,5,2005
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,5,2005
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,5,2005
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,5,2005
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,5,2005

In [6]:
# 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with 
# the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected 
# month and year.
def rental_count_month (month, year)-> pd.DataFrame:
    engine = create_engine('mysql+pymysql://root:'+password+'@localhost/sakila')
    rentals_filtered_month_year = rentals_month(engine, month, year)
    df = rentals_filtered_month_year.groupby(['customer_id','month','year']).size().reset_index(name = f'rentals_{month:02d}_{year}')
    return df

In [7]:
rental_count_month(5,2005)

     customer_id  month  year  rentals_05_2005
0              1      5  2005                2
1              2      5  2005                1
2              3      5  2005                2
3              5      5  2005                3
4              6      5  2005                3
..           ...    ...   ...              ...
515          594      5  2005                4
516          595      5  2005                1
517          596      5  2005                6
518          597      5  2005                2
519          599      5  2005                1

[520 rows x 4 columns]

In [8]:
# 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made 
# by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' 
# column, which is the difference between the number of rentals in the two months.
def compare_rentals(df1, df2):
    df3 = pd.merge(df1,df2,on = 'customer_id', how = 'inner')
    column_names = df3.columns
    count_columns = [c for c in column_names if c.startswith('rentals')]
    df3['difference'] = df3[count_columns[0]] - df3[count_columns[1]]
    df3 = df3.drop(columns = ['month_x','year_x','month_y','year_y'])
    return df3

In [9]:
compare_rentals(rental_count_month(5,2005),rental_count_month(6,2005))

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                7          -5
1              2                1                1           0
2              3                2                4          -2
3              5                3                5          -2
4              6                3                4          -1
..           ...              ...              ...         ...
507          594                4                6          -2
508          595                1                2          -1
509          596                6                2           4
510          597                2                3          -1
511          599                1                4          -3

[512 rows x 4 columns]